{
  "batch": "1980s-1990s",
  "researchDate": "2026-02-14",
  "findings": [
    {
      "id": 1,
      "name": "Hype",
      "city": "River Edge",
      "years": "1990-1993",
      "archiveUrl": null,
      "historicalNotes": "Hype was a music magazine published out of River Edge, NJ, connected to the Word Up! publishing ecosystem. It was part of the Faces Magazines / Enoble Media family of teen entertainment publications based in the Paramus/River Edge area of Bergen County, NJ. The magazine focused on hip-hop and R&B music content for teen audiences. Note: A separate, unrelated modern publication called 'The Hype Magazine' exists today as an urban culture outlet but has no direct connection to the 1990s River Edge publication. No digitized archive of the original Hype magazine was found online."
    },
    {
      "id": 13,
      "name": "City News",
      "city": "Plainfield",
      "years": "1983",
      "archiveUrl": null,
      "historicalNotes": "City News was a Black publication from Plainfield, NJ, circa 1983. Limited information is available online. Plainfield had an active Black press during this period; the Library of Congress catalogs 'Plainfield Today' (1983-1988), published by Henry Johnson, as another Black newspaper from the same city and era. The Plainfield Public Library's Local History Department holds the largest newspaper archive in Union County and may have copies. City News appears on the Wikipedia list of African American newspapers in New Jersey."
    },
    {
      "id": 74,
      "name": "Bootstrap",
      "city": "Newark",
      "years": "1981-1983",
      "archiveUrl": null,
      "historicalNotes": "Bootstrap was a Black publication from Newark, NJ, active from approximately 1981 to 1983. No digitized copies or detailed historical records were found online. Newark had a vibrant Black publishing scene during this era; the Newark Public Library's New Jersey Information Center maintains extensive archives of local periodicals from this period, including publications like Grafrica (1981-1982). The Newark Public Library's Charles F. Cummings NJ Information Center would be the most likely repository for physical copies."
    },
    {
      "id": 78,
      "name": "Fotorama",
      "city": "River Edge",
      "years": "1993",
      "archiveUrl": null,
      "historicalNotes": "Fotorama was a photography magazine with its premiere issue (#1) published in 1993, featuring covergirl Charmaine on the cover. Published out of River Edge, NJ, it was part of the cluster of Black entertainment magazines produced in Bergen County during the early 1990s alongside Word Up!, Hype, and related titles. The magazine appears to have been a celebrity photography publication. Copies of the premiere issue are available through Amazon and vintage magazine dealers, but no digitized archive exists online."
    },
    {
      "id": 96,
      "name": "Right On! Presents Class",
      "city": "Cresskill",
      "years": "1983",
      "archiveUrl": null,
      "historicalNotes": "Right On! Presents Class was a special edition or spin-off publication of Right On! magazine, published in 1983 from Cresskill, NJ. Right On! was first published in 1971 by the Laufer Company as a Black teen entertainment magazine modeled as an African-American counterpart to Tiger Beat. By the early 1980s, under editor-in-chief Cynthia Horner (who took the helm in 1976 at age 21), Right On! was expanding with spin-off titles. 'Class' appears to have been one such spin-off, likely targeting a slightly older or more sophisticated demographic. The Laufer Company and its successors (later Sterling/MacFadden) operated from various NJ locations including Cresskill in Bergen County. No digitized copies were found online."
    },
    {
      "id": 124,
      "name": "The Best of Rap & R&B",
      "city": "Paramus",
      "years": "1988",
      "archiveUrl": null,
      "historicalNotes": "The Best of Rap & R&B was a music publication from Paramus, NJ, published in 1988. It was likely produced by one of the teen entertainment publishing companies based in the Paramus area (Sterling's Magazines or MacFadden, which formally merged in 1991-1992). These companies published multiple fan and music magazines including Right On!, Teen Beat, 16 Magazine, Tiger Beat, and Metal Edge. The Best of Rap & R&B appears to have been a special edition or compilation publication capitalizing on the late-1980s explosion of hip-hop and R&B. No digitized copies or detailed publication records were found online."
    },
    {
      "id": 130,
      "name": "Communique: NJ Coalition of 100 Black Women",
      "city": "East Orange",
      "years": "1983",
      "archiveUrl": null,
      "historicalNotes": "Communique was a newsletter published by the New Jersey chapter of the National Coalition of 100 Black Women, based in East Orange, NJ, circa 1983. The National Coalition of 100 Black Women, Inc. was founded in 1981 to advocate on behalf of Black women and girls, promoting leadership development and gender equity in health, education, and economic empowerment. Multiple NJ chapters exist today, including Bergen/Passaic (founded 1986) and Southern NJ chapters. The East Orange chapter's newsletter would have documented early organizing activities of this nationally significant organization. No digitized copies were found; the Schomburg Center for Research in Black Culture or local East Orange archives may hold physical copies."
    },
    {
      "id": 82,
      "name": "Hype Hair",
      "city": "Paramus",
      "years": "1993-present",
      "archiveUrl": null,
      "historicalNotes": "Hype Hair was founded in 1992 by editor-in-chief Belinda Trotter, who developed the concept while working as editor-in-chief for the 2 Hype fanzine under the Word Up! publication house in Paramus, NJ. Publisher Scott Figman greenlit the standalone magazine after the hairstyle sections proved enormously popular. Hype Hair became the #1 hair and beauty publication for women of color, published nine times per year featuring hairstyles, beauty products, and celebrity coverage. The magazine was Black women-led since its founding but was only Black-owned from 2013-2017 under UPTOWN Ventures Group. In 2021, Lia Dias (owner of The Girl Cave LA beauty supply stores) purchased the magazine, making it Black-owned again. Dias merged her beauty supply chain with the brand to launch Hype Hair Beauty Supply stores in California and Texas. The magazine is now digital-only, headquartered in Los Angeles."
    },
    {
      "id": 114,
      "name": "Word Up!",
      "city": "Paramus",
      "years": "1987-2012",
      "archiveUrl": null,
      "historicalNotes": "Word Up! debuted in August 1987 as a spin-off of Right On! magazine, headquartered in Paramus, NJ under Enoble Media and publisher John Blassingame. Gerrie Summers served as founding editor-in-chief, shortly after replaced by Kate Ferguson. The magazine was a glossy, visually engaging teen publication featuring hip-hop and R&B artist interviews, pin-ups, fashion tips, a pen pals section called 'Pass the Word,' crossword puzzles, and song lyrics. Principal photographer was Ernie Paniccioli. Word Up! was famously immortalized by The Notorious B.I.G. in 'Juicy' (1994): 'It was all a dream; I used to read Word Up! magazine.' Rap Masters was its sister publication, both produced by Faces Magazines in Paramus. The magazine circulated from 1987-2012, proving indispensable in launching careers of countless hip-hop and R&B legends. In the 2020s, Cynthia Horner (former Right On! editor-in-chief) purchased both titles, forming Right On! Media Holdings, LLC. In 2023, the Notorious B.I.G. Estate partnered with Budweiser to release limited-edition tribute issues (5,000 copies each) during Hip-Hop 50 celebrations."
    },
    {
      "id": 118,
      "name": "Gospel Today Magazine",
      "city": "Fort Lee",
      "years": "1989-2013",
      "archiveUrl": "https://aaamc.indiana.edu/Collections/Teresa-Hairston",
      "historicalNotes": "Gospel Today was founded in 1989 by Dr. Teresa Hairston as a four-page newsletter, launched with just $300 while she was a divorced mother of three working two jobs. The newsletter grew into the longest-running and most widely distributed Urban Christian Lifestyle magazine in history. In 1992, Hairston launched companion publication SCOREBOARD (a gospel music industry trade journal), which later became Gospel Industry Today. Content expanded from gospel music coverage to all aspects of Christian lifestyle, featuring interviews with Denzel Washington, Whitney Houston, Evander Holyfield, Jesse Jackson, and others. At its peak, Gospel Today had a circulation of 240,000. In 2008, Lifeway Christian Bookstores pulled the magazine from shelves after it featured women pastors on its cover, conflicting with Southern Baptist beliefs. The magazine never fully recovered. Hairston stepped down in 2011, passing leadership to her son Roland T. Hairston II. The magazine transitioned to digital-only before ceasing operations circa 2013. Hairston also created the Gospel Today TV show (Word TV network) and founded the Gospel Heritage Foundation (1994). Her archival collection, including magazines, audio interviews, 5,000+ sound recordings, and promotional materials, was donated to Indiana University's Archives of African American Music and Culture (AAAMC) in 2016. Hairston published her memoir 'Unstoppable' in 2021."
    },
    {
      "id": 112,
      "name": "Captain Africa",
      "city": "Glen Ridge",
      "years": "1992-1994",
      "archiveUrl": "https://archive.org/details/captainafrica00dway",
      "historicalNotes": "Captain Africa was a Black comic book series created, written, and illustrated by Dwayne J. Ferguson, published by African Prince Productions out of Glen Ridge (and also Somerville), New Jersey. The series debuted with issue #1 in June 1992. The story follows Prince Najee M'Witu, who secretly dons the Falcon Shadow suit of armor (created with his inventor friend Buni Mandella) to protect the high-tech African metropolis of Egyptica from the villain Terror Supreme. Armed with the power of the Black Flame and mastery of the African martial art Kupigani Ngumi, Captain Africa was a pioneering Black superhero of the early 1990s independent comics movement. The series ran three issues (#1 June 1992, #2 October 1993, #3 February 1994) plus an ashcan #0, published through African Prince Productions and Diehard Studios. A graphic novel adaptation, 'Captain Africa: The Battle for Egyptica,' was also published by Africa World Press. Issues are now extremely rare collectors' items. The Internet Archive hosts a borrowable copy of the graphic novel."
    },
    {
      "id": 54,
      "name": "Journal of African American Men",
      "city": "New Brunswick",
      "years": "1995-2002",
      "archiveUrl": "https://www.jstor.org/journal/jafricanamermen",
      "historicalNotes": "The Journal of African American Men was an academic quarterly published by Transaction Publishers in New Brunswick, NJ, from Vol. 1, No. 1 (Summer 1995) through Vol. 6, No. 4 (Spring 2002). It served as the official publication of the National Council of African American Men. The journal covered a range of scholarly topics relevant to African American men, including a notable special issue on 'Impacts of Incarceration on the African American Family' (Summer 2001). Transaction Publishers, based at Rutgers University in New Brunswick, was a leading academic publisher of social science journals and books. The Journal of African American Men was succeeded by the Journal of African American Studies, which continues publication. The complete archive is available through JSTOR."
    },
    {
      "id": 121,
      "name": "Testimony: Journal of African-American Poetry",
      "city": "Montclair",
      "years": "1987",
      "archiveUrl": null,
      "historicalNotes": "Testimony: A Journal of African-American Poetry was a quarterly poetry journal published out of Montclair, NJ, edited by Sandra West. Two issues were published in 1987: Vol. 1, Issue One (Winter 1987) and Vol. 1, Issue Two (Spring 1987). Each issue was in 8.5x11 inch stapled wraps, running 30-34 pages. Issue One contained poetry on Black life, Black uplift, and Black alienation. Issue Two explored the political landscape with a pan-African scope, featuring poems including 'Apartheid,' 'Why Malcolm Had to Leave,' 'Frustrations of a NeoRevolutionary,' and 'Political FatCats.' Notable contributor Sonia Sanchez contributed 'MIA's (Missing in action and other atlantas).' The journal is extremely rare: only four institutional holdings are recorded in OCLC (Rutgers University, New York Public Library, Williams College, and Newark Public Library). No copies are known to be in commerce. The journal represents Montclair's role as a center of Black literary activity in northern New Jersey during the 1980s."
    },
    {
      "id": 40,
      "name": "The Nubian News",
      "city": "Trenton",
      "years": "1989-present",
      "archiveUrl": null,
      "historicalNotes": "The Nubian News was founded circa 1988-1989 by publisher Kamau Kujichagulia and is the only bilingual (English and Spanish) African American newspaper in New Jersey. Based at 25 South Westfield Avenue, Trenton, NJ 08618, the newspaper has been in continuous publication for over 35 years, covering local events, politics, and community issues relevant to Trenton's Black community. Kujichagulia remains the publisher and key principal. The Nubian News also produces the podcast 'On The Case,' featuring weekly interviews with community leaders every Thursday at 8 PM EST. The paper gained wider attention in 2020 when Kujichagulia organized a rally in support of Trenton councilwoman Robin Vaughn. The Nubian News Corporation operates the newspaper's current digital presence at thenubiannews.com. No digitized historical archive of print issues was found online."
    },
    {
      "id": 5,
      "name": "The Connection / North Jersey Connection",
      "city": "Teaneck",
      "years": "1982-present",
      "archiveUrl": "https://www.loc.gov/item/sn92060412/",
      "historicalNotes": "The North Jersey Connection was a biweekly African American newspaper published in Teaneck, NJ by Connection Publications. The Library of Congress catalogs it with LCCN sn92060412, with the earliest described issue being No. 9 (Oct. 22, 1983). The exact founding date is uncertain but falls in the early 1980s, consistent with the 1982 date. The paper was later succeeded by or renamed to The Connection (Teaneck, N.J.), LCCN sn88071369, which continued publication and grew to describe itself as 'News from a Black perspective' and the 'Largest African-American weekly newspaper in New Jersey.' The Connection was published by Ralph F. Johnson. The newspaper served Bergen County and northern New Jersey's Black community, providing local news coverage from a Black perspective during a period when Teaneck was one of the first communities in the nation to voluntarily desegregate its schools (1965). The Library of Congress holds the catalog record, though physical copies may be held at other libraries."
    }
  ]
}
