{
  "batch": "pre-1940",
  "researchDate": "2026-02-14",
  "findings": [
    {
      "id": 34,
      "name": "The Landscape",
      "city": "Saddle River",
      "years": "1881-1901",
      "archiveUrl": "https://jerseyhistory.org/newspapers-o-z/",
      "historicalNotes": "A four-page monthly newspaper written, printed, and published by A.P. Smith from his home at 171 East Allendale Road (corner of Chestnut Ridge Road) in Saddle River, Bergen County, NJ. First published in 1881 (not 1885 as sometimes cited), it continued until Smith's death in 1901. Originally intended as 'A LETTER TO OUR FRIENDS on matters of interest,' it contained neighborhood news, political commentary, and local advertisements. Smith served as editor, printer, and publisher. The newspaper is considered a valuable resource for Saddle River Valley historical research. The history of A.P. Smith and The Landscape has been the subject of lectures by Arnold E. Brown, civil rights leader and founder of the Du Bois Book Center in Englewood, who was also the first African American from Bergen County elected to the NJ State Legislature."
    },
    {
      "id": 10,
      "name": "The Sentinel",
      "city": "Trenton",
      "years": "1880-1882",
      "archiveUrl": "https://chroniclingamerica.loc.gov/lccn/sn84026314/",
      "historicalNotes": "Founded by R. Henri Herbert, The Sentinel was Trenton's first and New Jersey's earliest African American newspaper. Herbert, born in 1857, began publishing the staunchly Republican weekly in his early twenties. Publication ran from Vol. I, no. 8 (June 26, 1880) through Vol. III, no. 19 (November 13, 1882). Herbert asserted the paper stood for 'earnest advocacy of the broadest freedom and purest liberty for white men, black men, Chinamen, and all men alike.' Advertisers included the Irish National Land & Industrial League, the Ancient Order of Hibernians, the local National Guard regiment, and the local Grand Army of the Republic chapter. The Sentinel later merged with the Trenton Herald at 4 North Broad Street. Herbert was a native of Trenton, son of Mansfield Herbert, a cabinet maker and artistic picture framer (whose clients included John A. Roebling). Henri's sister Priscilla Herbert was the first African American to graduate from the State Normal School (now College of New Jersey) in 1879. Issues were digitized from microfilm created by the Committee on Negro Studies of the American Council of Learned Societies and are available through Chronicling America."
    },
    {
      "id": 38,
      "name": "New Jersey Trumpet",
      "city": "Jersey City/Newark",
      "years": "1887-1897",
      "archiveUrl": "https://www.loc.gov/item/sn87068175/",
      "historicalNotes": "A weekly newspaper published by Col. William H. Murrell (listed as 'Wm. Murrell'). First issue December 29, 1887; ceased around 1897. Originally based in Jersey City, it relocated to Newark in 1889. Murrell was born into slavery in Georgia and served during the Civil War as a valet to Confederate General Longstreet, later enlisting in the 44th regiment Virginia and South Carolina troops. After the war he moved to Louisiana, served in the State Legislature for nine years, and was a colonel of the 4th Regiment, Louisiana State National Guard. After losing his possessions in the great flood of 1878 and receiving death threats from the KKK, he moved to Washington D.C. (Treasury Department), then to New Jersey in 1883 where he established The Trumpet. His wife Louisiana served as business manager. Two of their sons, William Frederick and Wellington, were killed in the Spanish-American War and are buried in Arlington National Cemetery.",
      "missionStatement": "Served the Black community in Jersey City and Newark during the late 19th century as a voice for African American interests in New Jersey."
    },
    {
      "id": 31,
      "name": "The Echo",
      "city": "Long Branch/Red Bank",
      "years": "1904-1943",
      "archiveUrl": "https://chroniclingamerica.loc.gov/lccn/sn88071050/",
      "historicalNotes": "Founded in 1904 by William Elijah Rock in Long Branch, NJ. Rock was born at Pine Brook, NJ on January 22, 1861, son of Peter and Emma (Schanck) Rock, whose grandfather came from Africa and settled in New Jersey around 1700. Rock was educated in public schools at Pine Brook, received private instruction under Prof. John R. Porter in New York for 4 years, and read law in the office of T.W. Throckmorton in Red Bank for 8 years. The newspaper was named after his Lenni-Lenape mother Emma Schanck-Rock, per her original tribal name translated to English. Publishers listed as Rock and Howard. Relocated from Long Branch to Red Bank in 1909, established with capital of $50. Rock died in June 1933 and the paper folded in 1943. Was described as 'The oldest colored paper in New Jersey.' Per The State Historical Society of Wisconsin's Who's Who of the Colored Race Volume One (1915), Rock is listed alongside Madame C.J. Walker. Original issues available at Red Bank Public Library digital collection.",
      "missionStatement": "Published weekly 'in interest of Negro race.' Empowered communities of color with a platform to express opinions and interests on local, national, and international current affairs."
    },
    {
      "id": 9,
      "name": "The Newark Herald",
      "city": "Newark",
      "years": "1928-1939",
      "archiveUrl": "https://chroniclingamerica.loc.gov/lccn/sn88071222/",
      "historicalNotes": "Published by the Newark Herald Publishing Co. as a weekly African American newspaper. Bibliographic description based on Vol. 11, no. 18 (June 11, 1938). The Herald's founder formed or helped form numerous political organizations including the Negro Progressive Republican League and the Young Men's Colored Republican Association of the City of Newark. Banner headlines addressed issues like 'Poor Housing Conditions are Assailed in Englewood' and 'Negro Must Use Politics to Win Rights.' Succeeded by the New Jersey Herald News (1938-1966). Historian Clement Price noted: 'Had not the black press in New Jersey dramatized the grievances and aspirations of the race, civil rights activities would have been without a powerful voice.' Available on microfilm at Newark Public Library and Rutgers Alexander Library. Newark Public Library has digitized issues in their African American Newark Newspapers collection.",
      "missionStatement": "Dramatized the grievances and aspirations of African Americans in New Jersey, serving as a powerful voice for civil rights activities and political organizing in the Black community."
    },
    {
      "id": 16,
      "name": "New Jersey Herald News",
      "city": "Newark",
      "years": "1938-1966",
      "archiveUrl": "https://chroniclingamerica.loc.gov/lccn/sn84025698/",
      "historicalNotes": "Published by the New Jersey Herald News Publishing Co. beginning May 1938, ceasing around 1966. Weekly English-language newspaper edited by Oliver W. Brown (O.W. Brown). Succeeded The Newark Herald (1928-1939). Earliest description based on Vol. 1, No. 3 (May 21, 1938). Later succeeded by the Advance (Newark, 1965-1966) and Herald-Advance (Newark, 1966-). Digitized issues from 1938 available via Internet Archive. Also available through Newark Public Library Digital Archive.",
      "missionStatement": "Described as 'Owned and published by New Jersey Negroes,' serving the African American community of Newark and Essex County."
    },
    {
      "id": 37,
      "name": "The New Jersey Guardian",
      "city": "Newark",
      "years": "1934-1942",
      "archiveUrl": "https://chroniclingamerica.loc.gov/lccn/sn89069097/",
      "historicalNotes": "Published weekly in Newark, Essex County, NJ by the N.J. Guardian Pub. Co. Began with the September 29, 1934 issue; ceased in 1942 (exact end date uncertain). Carried the motto 'Voice of the Colored People.' Bibliographic description based on Vol. 6, no. 27 (Oct. 28, 1939). Cataloged by the Library of Congress under African Americans -- New Jersey -- Newspapers. The Library of Congress may not hold copies; holdings may exist at other libraries."
    },
    {
      "id": 57,
      "name": "The Ironsides Echo",
      "city": "Bordentown",
      "years": "1917-1955",
      "archiveUrl": "https://www.njstatelib.org/ironsides_echo/",
      "historicalNotes": "Student newspaper of the Manual Training and Industrial School for Colored Youth at Bordentown (the 'Bordentown School'), also known as 'the Tuskegee of the North.' The school was founded in 1886 (originally 1876) by Rev. Walter A. Rice, a former slave and AME Church minister, beginning with 10 students in two wood-clapboard homes on West Street. The name 'Ironsides' derives from the school's location on the former estate of Commodore Charles Stewart, commander of the USS Constitution ('Old Ironsides') during the War of 1812. Frances O. Grant founded the drama club and The Ironsides Echo, which won multiple prizes from organizations including the National Scholastic Association. Grant invited prominent figures including Mary McLeod Bethune, W.E.B. Du Bois, James Weldon Johnson, Paul Robeson, Albert Einstein, and Eleanor Roosevelt to speak at the school. The paper was printed by students in the printing trades program and served as outreach -- both white and Black schools exchanged papers with them. The front page of the May-June 1939 edition announced Mary McLeod Bethune as Commencement Speaker. William R. Valentine became principal in 1915, viewing the school as offering practical education, stating: 'We cannot all be doctors, lawyers, dentists, and preachers... Thus the need of men in the trades.' The school closed in 1955 following the Brown v. Board of Education decision. Digitized issues (from 1935 onward) available through the New Jersey State Library's DSpace repository."
    },
    {
      "id": 48,
      "name": "Ash Can",
      "city": "Chatsworth",
      "years": "1935",
      "historicalNotes": "CCC camp newspaper. Associated with CCC Camp S-60 (Company 1284-C) at Penn State Forest, 13 miles south of Chatsworth, established October 30, 1933. No digitized copies found online. CCC camps in New Jersey were fully segregated by July 1935 per order of CCC Director Robert Fechner. Camp newspapers were a common feature of CCC camps, with an estimated 60-70 percent of camps producing their own publications. Further research recommended at the Center for Research Libraries (main repository for CCC camp newspapers) and National Archives Record Group 35.",
      "_researchNote": "Limited information found. No direct online references to this specific camp newspaper were located. The camp designation and company number were confirmed via the CCC Legacy camp list for New Jersey."
    },
    {
      "id": 87,
      "name": "Camp Cooper Chats",
      "city": "Glen Ridge",
      "years": "1935-1937",
      "historicalNotes": "CCC camp newspaper. No CCC camp directly listed for Glen Ridge in the CCC Legacy database; may have been associated with a nearby Essex County camp. CCC camps in New Jersey were segregated by 1935. No digitized copies found online. Further research recommended at the Center for Research Libraries, National Archives Record Group 35, and the book 'The CCC Chronicles: Camp Newspapers of the Civilian Conservation Corps, 1933-1942' by Alfred Emile Cornebise (chapter 8 covers African American experience).",
      "_researchNote": "Limited information found. No direct online references to this specific camp newspaper or a CCC camp at Glen Ridge, NJ were located."
    },
    {
      "id": 102,
      "name": "Camp Berlin Broadcast",
      "city": "Berlin",
      "years": "1934-1935",
      "historicalNotes": "CCC camp newspaper. Associated with CCC Camp SP-9 (Company 1275-C), located 1 mile west of Berlin, NJ (Camden County), established October 30, 1933. No digitized copies found online. CCC camps in New Jersey were segregated by 1935 per Director Fechner's order. Further research recommended at the Center for Research Libraries and National Archives Record Group 35.",
      "_researchNote": "Limited information found. No direct online references to this specific camp newspaper were located. The camp designation and company number were confirmed via the CCC Legacy camp list for New Jersey."
    },
    {
      "id": 2,
      "name": "The Jersey Express",
      "city": "Montclair",
      "years": "1932",
      "_researchNote": "No substantive information found through web searches. The newspaper is listed among African American newspapers published in New Jersey but no archiveUrl, mission statement, or detailed historical notes could be confirmed from available online sources. Further research recommended at the Montclair Public Library, Montclair History Center, Newark Public Library's NJ Information Center, and the Harvard bibliography 'African-American Newspapers and Periodicals: A National Bibliography' (1998)."
    },
    {
      "id": 3,
      "name": "The Camden News",
      "city": "Camden",
      "years": "1915-1918",
      "_researchNote": "No substantive information found through web searches. No matching record was located in Chronicling America, Library of Congress, or major digitized newspaper databases. The newspaper may survive only in specialized archives. Further research recommended at the Camden County Historical Society (admin@cchsnj.org), Rutgers University-Camden library microfilm holdings, Accessible Archives African American Newspapers database, and New Jersey State Archives."
    }
  ]
}
