{
  "batch": "1940s-1960s",
  "researchDate": "2026-02-14",
  "findings": [
    {
      "id": 11,
      "name": "The Northern New Jersey Informer",
      "city": "Paterson",
      "startYear": 1950,
      "archiveUrl": null,
      "missionStatement": null,
      "historicalNotes": "No specific archival or historical records were found for The Northern New Jersey Informer in online databases including the Library of Congress, New Jersey State Library digitized newspapers, Chronicling America, or the Wikipedia list of African American newspapers in New Jersey. The publication does not appear in the New Jersey Historical Society newspaper inventory. It may have been a short-lived local community newspaper serving Paterson's African American population, which numbered approximately 8,270 (about 6% of the city's 139,336 residents) in the 1950 census. Physical copies or microfilm may exist at the Paterson Free Public Library, the Passaic County Historical Society, or in the Danky & Hady bibliography 'African-American Newspapers and Periodicals: A National Bibliography' (Harvard University Press, 1998).",
      "researchNotes": "Searched Library of Congress, NJ State Library, NJ Historical Society, Wikipedia. No digital or archival records found online."
    },
    {
      "id": 18,
      "name": "The Liberator",
      "city": "Paterson",
      "startYear": 1950,
      "archiveUrl": null,
      "missionStatement": null,
      "historicalNotes": "No specific records were found for a publication called The Liberator published in Paterson, NJ around 1950 in the African American press context. This title should not be confused with William Lloyd Garrison's famous abolitionist newspaper The Liberator (Boston, 1831-1865), nor with the 1960s New York-based Liberator magazine (1961-1971) associated with the Black liberation movement. The Paterson Liberator may have been a small community newspaper serving the city's growing African American population during the postwar era. Physical records may exist at the Newark Public Library's New Jersey Information Center, the Passaic County Historical Society, or in the Danky & Hady national bibliography of African American newspapers and periodicals.",
      "researchNotes": "Searched Library of Congress, Wikipedia, NJ newspaper inventories. No digital records found. Disambiguation from other publications with same name confirmed."
    },
    {
      "id": 30,
      "name": "North Jersey Independent",
      "city": "Paterson",
      "startYear": 1950,
      "archiveUrl": null,
      "historicalNotes": "No specific archival records were found for the North Jersey Independent from Paterson in online databases. A related publication, the New Jersey Herald News (Newark, 1938-1966), was described as 'Independent' and 'Owned and published by New Jersey Negroes' with editor O.W. Brown, but this was a separate Newark-based publication. The North Jersey Independent may have been a community newspaper serving Paterson's African American residents. Physical copies may survive at the Paterson Free Public Library, the New Jersey State Archives, or in the comprehensive Danky & Hady bibliography.",
      "researchNotes": "Searched Library of Congress, NJ State Library, Wikipedia list of African American newspapers in NJ. No records found online."
    },
    {
      "id": 33,
      "name": "The Black Observer",
      "city": "Camden",
      "startYear": 1968,
      "archiveUrl": "https://scarletandblack.rutgers.edu/archive/items/show/949",
      "historicalNotes": "The Black Observer was a community-oriented newspaper produced by Rutgers-Camden students affiliated with the Black Student Unity Movement (BSUM). A complete surviving issue dates to circa fall 1969. The paper was created by student activists for the broader Camden community during the height of the Black Power movement. The editorial team included Roy Jones, Marie Spearman, Faye Waters, Myrna Williams, Vince Mayfield, Carolyn Williams, Ralph Spencer, Richard Rhodes, Alice Syms, Linda Ellis, R. Eugene Kirkland, Lillian Matthews, Fredia Bodie, and Betty Coleman. A letter from Aaron G. Thompson on behalf of the Rutgers BSUM appears on page 5 of the surviving issue. The complete issue is housed in Special Collections at the Paul Robeson Library, Rutgers University-Camden, as part of the Campus Ephemera Collection within the broader 'Black Student Activism in Camden' collection.",
      "researchNotes": "Digitized issue found in the Rutgers Scarlet and Black Digital Archive. Connected to Rutgers-Camden's Black Student Unity Movement."
    },
    {
      "id": 41,
      "name": "The Voice",
      "city": "Plainfield",
      "yearRange": "1968-1974",
      "archiveUrl": "https://www.loc.gov/item/sn88063027/",
      "historicalNotes": "The Voice was an African American weekly newspaper published in Plainfield, New Jersey by Voice Associates. It began publication in 1968, notably just one year after the 1967 Plainfield riots (part of the broader Long Hot Summer of 1967), which were a watershed event for the city's African American community. The Library of Congress catalog description is based on Vol. 4, No. 5 (Jan. 24, 1971), confirming it was still publishing at least into its fourth year. The paper was illustrated and measured 44 cm. Its LCCN is sn88063027 and OCLC number is 17430825. The end date of publication is listed as unknown in Library of Congress records. The Library of Congress may not hold physical copies, but other libraries may have holdings.",
      "researchNotes": "Library of Congress catalog entry found with publication details. Published after the 1967 Plainfield riots."
    },
    {
      "id": 70,
      "name": "Deliverance Voice",
      "city": "Newark",
      "startYear": 1967,
      "archiveUrl": null,
      "historicalNotes": "No specific archival or historical records were found for the Deliverance Voice in online databases including the Library of Congress, Chronicling America, or the Wikipedia list of African American newspapers in New Jersey. The name suggests a possible connection to a religious organization or church community, as 'Deliverance' is a common term in African American church traditions. The publication appeared in 1967, the same year as the Newark Rebellion (July 12-17, 1967), which was a pivotal event that spurred significant community organizing and media production in Newark's African American community. Physical records may exist at the Newark Public Library's Charles F. Cummings New Jersey Information Center, the Rutgers University Libraries, or the New Jersey Historical Society.",
      "researchNotes": "No online records found. Possible church-affiliated publication based on name. Year coincides with Newark Rebellion."
    },
    {
      "id": 79,
      "name": "The Hiram Star-News",
      "city": "Vauxhall",
      "startYear": 1947,
      "archiveUrl": null,
      "historicalNotes": "No specific archival or historical records were found for The Hiram Star-News from Vauxhall, NJ in online databases. Vauxhall is an unincorporated community within Union Township, Union County, New Jersey. The 1947 start date places it in the immediate postwar period when African American communities in northern New Jersey were growing due to wartime migration and postwar economic opportunities. The name 'Hiram' may reference a fraternal lodge or community organization, as Hiram lodges were common in African American Freemasonry (Prince Hall Masonry). Physical records may exist at the Union Township Public Library, the Union County Historical Society, or in the Danky & Hady national bibliography.",
      "researchNotes": "No online records found. Vauxhall is part of Union Township, Union County. Name may reference Prince Hall Masonic lodge."
    },
    {
      "id": 69,
      "name": "The Cricket: Black Music in Evolution",
      "city": "Newark",
      "startYear": 1969,
      "yearRange": "1968-1969",
      "archiveUrl": "https://www.blankforms.org/publications/the-cricket-black-music-in-evolution-1968-69",
      "missionStatement": "The Cricket aimed 'to provide Black Music with a powerful historical and critical tool' and to enable avant-garde Black musicians and writers 'to finally make a way for themselves.' It sought to reunite advanced art with its community and foster critical and political dialogue for Black musicians and writers.",
      "historicalNotes": "The Cricket: Black Music in Evolution was edited by Amiri Baraka, A.B. Spellman, and Larry Neal between 1968 and 1969. Published by Baraka's Newark-based Jihad Productions, it was a mimeographed experimental music magazine that ran for four issues. The Cricket emerged from the heart of the Black Arts Movement, published shortly after the 1967 Newark Rebellion. Over its four issues, it laid out an anticommercial ideology and took aim at the conservative jazz press, providing space for critics, poets, journalists, and musicians to devise new styles of music writing. It ran poetry, position papers, and gossip alongside concert and record reviews and essays on music and politics. Contributors included Albert Ayler, Milford Graves, Sun Ra, Cecil Taylor, Stanley Crouch, Haki Madhubuti (Don L. Lee), Ishmael Reed, Sonia Sanchez, Keorapetse Kgositsile, Mtume, Black Unity Trio, Ben Caldwell, Askia Muhammad Toure, and many others. The fourth issue (1969) is particularly notable for containing Albert Ayler's letter 'To Mr. Jones -- I had a Vision,' describing an intense UFO sighting/religious revelation Ayler and his brother experienced in New Jersey. The complete facsimile of all four issues was republished by Blank Forms Editions with an introduction by poet and scholar David Grundy, author of 'A Black Arts Poetry Machine: Amiri Baraka and the Umbra Poets' (Bloomsbury Academic, 2019).",
      "researchNotes": "Well-documented publication. Blank Forms Editions reprint available. Multiple scholarly sources confirm details."
    },
    {
      "id": 67,
      "name": "Bronze Thrills",
      "city": "Dover",
      "yearRange": "1952-1981",
      "archiveUrl": null,
      "missionStatement": "Bronze Thrills provided African American readers with romance, true confessions, and women's interest stories written in a style familiar to its audience. Its predecessor, The World's Messenger (founded 1942), was innovative in featuring stories written in the dialect of Southern working-class African Americans.",
      "historicalNotes": "Bronze Thrills was a Black romance and confessions-style magazine that evolved from The World's Messenger, founded in 1942 by Horace J. Blackwell, an African American minister and clothing merchant in Fort Worth, Texas. After Blackwell's death in 1949, his widow sold the publication to George T. Levitan, a white businessman, who renamed it Bronze Thrills and continued publishing through Good Publishing Company (also known as Sepia Publishing), based in Fort Worth. Good Publishing also produced the magazines Sepia, Hep, and Jive for African American audiences. Bronze Thrills featured true romance, true confessions, and women's interest articles alongside essays on African American issues. While Sepia did not equal the newsstand sales of Bronze Thrills, it was Sepia that became the most successful competitor to Ebony for nearly four decades. After Levitan's death in 1976, the publications were sold to Beatrice Pringle, returning them to Black ownership. The business closed around 1983. Note: All available sources identify Fort Worth, Texas as the base of Good Publishing. The connection to Dover, New Jersey may reflect a regional editorial or distribution office, but this could not be confirmed through online sources. The magazine's records and building were mostly destroyed after the business closed; the African American Museum in Dallas now holds the picture files.",
      "researchNotes": "Well-documented as a Fort Worth, Texas publication. Dover NJ connection could not be confirmed online. May require physical archival research."
    },
    {
      "id": 73,
      "name": "Utimme Umana/La Voz Oculta",
      "city": "Trenton",
      "startYear": 1968,
      "archiveUrl": "https://dr.tcnj.edu/handle/2900/2322",
      "historicalNotes": "Utimme Umana/La Voz Oculta was a minority student newspaper at Trenton State College (now The College of New Jersey). The original Utimme Umana was incorporated in 1968 as a Black student newspaper, though it initially struggled to gain footing. On October 2, 1972, the first issue of the combined Utimme Umana: La Voz Oculta was published, merging the Black student paper with a Hispanic voice. 'Utimme Umana' means 'rebirth' in Swahili, while 'La Voz Oculta' means 'the hidden voice' in Spanish. The paper's defining mission was to combat ignorance on the topics of race and it encouraged readers to help spread the word. The publication presented poetry, short stories, and essays relating predominantly to Black, Hispanic, and Latinx themes, along with social and cultural events, announcements, reviews, letters to the editor, photographs, and drawings. It was published twice monthly in newspaper format until early 1978 when it changed to a magazine format, with issues averaging 30 pages. The publication ran from 1972 to 1990. Its founding was part of a broader movement at Trenton State College where, following the assassination of Martin Luther King Jr. in April 1968, African American students presented a list of 10 demands to President Robert Heussler, including creation of an Afro-American Studies program, increased Black student enrollment, hiring Black entertainment, and having a dedicated space on campus for Black students. Digitized issues are available through the TCNJ Digital Repository.",
      "researchNotes": "Well-documented through TCNJ archives. Digitized issues available. Founded 1968, first combined issue 1972, ran until 1990."
    },
    {
      "id": 76,
      "name": "Newark Community Union Project News",
      "city": "Newark",
      "yearRange": "1963-1965",
      "archiveUrl": null,
      "historicalNotes": "The Newark Community Union Project (NCUP) was established in 1964 as part of the Students for a Democratic Society (SDS) Economic Research and Action Project (ERAP), co-led by Tom Hayden and Carl Wittman. NCUP settled into the Clinton Hill neighborhood in South Newark in the summer of 1964, consisting of about 12-15 organizers (half Black, half white college students and graduates). While a specific newsletter titled 'NCUP News' was not confirmed in online sources, NCUP produced community publications and flyers as part of its organizing work in the predominantly Black Clinton Hill neighborhood. The project focused on housing issues, organizing rent strikes (which were illegal in New Jersey), picketing slumlords' homes, and conducting block meetings to address rats, roaches, unsafe living conditions, and police misconduct. NCUP's work is documented in the 1966 documentary film 'Troublemakers.' By late summer 1965, the project staff had dwindled to about half a dozen organizers, though an estimated 150 local people participated in various programs and meetings. The 1967 Newark Rebellion effectively ended NCUP, as the uprising convinced the remaining white organizers they were unwanted. NCUP's methods -- rent strikes, picketing, block meetings -- had by then spread to other parts of the city. Archival materials may exist at the NYU Tamiment Library, Rutgers University Libraries, or the Library of Congress, which catalogs materials under the subject heading 'Newark Community Union Project (N.J.)'.",
      "researchNotes": "NCUP well-documented but specific newsletter title not confirmed. SDS/ERAP connection verified. Documentary 'Troublemakers' (1966) documents the project."
    },
    {
      "id": 62,
      "name": "Afro-American Festival of the Arts Magazine",
      "city": "Newark",
      "startYear": 1966,
      "archiveUrl": null,
      "historicalNotes": "The Afro-American Festival of the Arts Magazine was published in August 1966 in Newark, New Jersey. It was edited and partially written by LeRoi Jones (later Amiri Baraka), whose name appears among the staff listed on page 8 of the publication. The magazine featured articles by Jones alongside Ed Spriggs, Sonia Sanchez, Larry Neal, Joe White, Yusef Inman, Ben Caldwell, and others -- many of whom were key figures in the emerging Black Arts Movement. The publication is connected to Baraka's Black Nationalist period, following his move from Greenwich Village to Newark in 1965 and the founding of the Spirit House theater. It was published in the same year that Baraka's Jihad Productions in Newark published his poetry collection 'Black Art,' the first volume of the three-part work 'Black Magic: Poems 1961-66.' A copy is held in the Harris Collection of American Poetry and Plays at Brown University Library.",
      "researchNotes": "Found through Brown University Library's Baraka exhibit. Single issue publication from August 1966. Connected to early Black Arts Movement in Newark."
    },
    {
      "id": 35,
      "name": "New Jersey Afro-American",
      "city": "Newark",
      "startYear": 1941,
      "archiveUrl": "https://www.loc.gov/item/sn84025926",
      "historicalNotes": "The New Jersey Afro-American was the Newark regional edition of the Baltimore-based Afro-American newspaper chain, one of the most influential African American newspaper enterprises in the United States. Published weekly by the Afro-American Company from Vol. 1, No. 1 (March 15, 1941) through 1991, it served the African American communities of Newark and East Orange in Essex County, New Jersey. The parent Afro-American newspaper was founded in 1892 by John H. Murphy Sr. in Baltimore and expanded under editor Carl J. Murphy (who led the paper for 45 years starting in 1922) to include nine national editions in 13 major cities. At its peak, regional weekly editions were published in Baltimore, Washington D.C., Philadelphia, Richmond, and Newark. The chain employed notable journalists and intellectuals including Langston Hughes, William Worthy, and J. Saunders Redding. It was the first Black newspaper to employ a female sportswriter (Lillian Johnson and Nell Dodson in the mid-1930s), and artist Romare Bearden began his career as a cartoonist there in 1936. During World War II, the Afro-American stationed reporters in Europe, the Aleutians, Africa, Japan, and other parts of the South Pacific; Elizabeth Murphy Phillips Moss was the first Black female war correspondent. The New Jersey edition adopted Afro-American numeration in 1979. Princeton University Library holds microfilm copies from March 15, 1941 through 1972. The parent Afro-American remains in publication today as the oldest family-owned African American newspaper in the United States. LCCN: sn84025926.",
      "researchNotes": "Well-documented through Library of Congress and Chronicling America. Part of the Baltimore Afro-American chain. Microfilm at Princeton and Rutgers."
    },
    {
      "id": 28,
      "name": "Black Newark",
      "city": "Newark",
      "yearRange": "1968-1974",
      "archiveUrl": "https://collections.libraries.rutgers.edu/newark-black-newspapers",
      "historicalNotes": "Black Newark was the first in a series of interconnected newspapers published under the leadership of Amiri Baraka (LeRoi Jones) through the Committee for Unified Newark (CFUN) and its successor organizations. The publication sequence was: Black Newark (Vol. 1, Nos. 1-3, April-November 1968), then Black News (Vol. 1, No. 4, 1969, published by Black People of Newark), then Black New Ark (Vol. 1, No. 5, April 1972 through Vol. 2, No. 14, December 1973, published by CFUN), and finally Unity and Struggle (Vol. 3, No. 1, January/February 1974 through Vol. 8, No. 1/2, February 1979, published by CFUN as the national newspaper of the Congress of Afrikan People). These newspapers were published through the post-rebellion period of Newark, serving as tools for organizing and advocating for Black liberation and political and economic agency for Newark's majority Black citizenry. Baraka served as chairman of CFUN from 1968 to 1975. The movement documented in these papers contributed to the Black and Puerto Rican alliance that led to the election of Newark's first Black mayor, Kenneth Gibson, in 1970. The newspapers also covered Baraka's community-based initiatives addressing housing conditions, failing schools, and economic opportunities, including the Kawaida Towers apartment project and NJR-32 urban renewal project. The collection is digitized and searchable through the Rutgers Dana Library Newark Black Newspapers Collection. Additional copies are held at the NYU Tamiment Library and the Auburn Avenue Research Library. Scholarly treatment includes Jennifer Caroccio Maldonado's article 'Putting the Black Ink Back into Print: Black Newark/Black New Ark' in New Jersey Studies: An Interdisciplinary Journal 8(1), Winter 2022, pp. 34-49.",
      "researchNotes": "Well-documented through Rutgers digitized collection. Part of a sequence of four related newspapers (1968-1979) under Baraka's leadership."
    }
  ]
}
